app/controllers/songs_controller.rb

  def upload
    require "csv"
    CSV.foreach(params[:file].path, headers: true) do |song|
      artist = Artist.find_or_create_by(name: song["ARTIST CLEAN"])
      Song.find_or_create_by(title: song["Song Clean"], artist: artist)
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2019-06-24 01:07:33.783105"], ["updated_at", "2019-06-24 01:07:33.783105"]]
INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2019-06-24 01:07:33.885378"], ["updated_at", "2019-06-24 01:07:33.885378"], ["artist_id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT ?  [["name", ".38 Special"], ["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."title" = ? AND "songs"."artist_id" = 1 LIMIT ?  [["title", "Caught Up in You"], ["LIMIT", 1]]